In [1]:
import pandas as pd

In [3]:
df = pd.read_csv(r'D:\COMPUTER SCIENCE\YEAR ONE\SEM 2\mr muhame\my project\StudentsPerformance.csv')
print(df)

     gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1    female        group C                some college      standard
2    female        group B             master's degree      standard
3      male        group A          associate's degree  free/reduced
4      male        group C                some college      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[1000 rows x 8 columns]

In [6]:
numeric_columns = df.select_dtypes(include='number')
mean_values = numeric_columns.mean()
print (mean_values)

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

In [3]:
import pandas as pd

# Define the dataset as a dictionary
data = {
    'gender': ['female', 'female', 'female', 'male', 'male', ...],  # Replace ... with actual values
    'race/ethnicity': ['group B', 'group C', 'group B', 'group A', 'group C', ...],  # Replace ... with actual values
    'parental level of education': ["bachelor's degree", 'some college', "master's degree", "associate's degree", 'some college', ...],  # Replace ... with actual values
    'lunch': ['standard', 'standard', 'standard', 'free/reduced', 'standard', ...],  # Replace ... with actual values
    'test preparation course': ['none', 'completed', 'none', 'none', 'none', ...],  # Replace ... with actual values
    'math score': [72, 69, 90, 47, 76, ...],  # Replace ... with actual values
    'reading score': [72, 90, 95, 57, 78, ...],  # Replace ... with actual values
    'writing score': [74, 88, 93, 44, 75, ...]  # Replace ... with actual values
}

# Create the DataFrame
df = pd.DataFrame(data)

# Display the first few rows of the DataFrame
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [4]:
df.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,Ellipsis,Ellipsis,Ellipsis,Ellipsis,Ellipsis,Ellipsis,Ellipsis,Ellipsis

In [5]:
df.tail(10) # displays the last 10 rows

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,Ellipsis,Ellipsis,Ellipsis,Ellipsis,Ellipsis,Ellipsis,Ellipsis,Ellipsis

In [7]:
#how you can check the data type of the "math score" column:
print(df['math score'].dtype)

object

In [8]:
# how you can attempt to convert the column to numeric and handle any errors:
df['math score'] = pd.to_numeric(df['math score'], errors='coerce')

In [9]:
# converting the column to numeric, you can try calculating the mean again:
df['math score'].mean()

70.8

In [11]:
print(df.columns)

# check the column names of your DataFrame using the columns attribute:

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [17]:
print(df['writing score'].dtype)
# checking the data type of the "writing score" column to ensure it contains numeric values

object

In [18]:
# converting the column to numeric using the pd.to_numeric() function with the errors='coerce' parameter to handle non-numeric values:
df['writing score'] = pd.to_numeric(df['writing score'], errors='coerce')

In [19]:
# calculating the mean
df['writing score'].mean()

74.8